reddit_clone/app/models/user.rb

    def password=(password)
        @password = password
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "gea"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-10-06 15:09:03.804279"], ["updated_at", "2023-10-06 15:09:03.804279"]]